src/cf/Catalogs/пбп_ИсторияИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_ИсторияИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграцииВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВызова</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьИстории</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИсторияИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СтатусыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_ФорматыИнтеграций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИнтеграции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектИнтеграции</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИдентификатора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданОбновлен</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_СозданОбновлен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаписьРегистра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборыРегистра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/пбп_СтатусыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_СтатусыИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСлужебного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_ФорматыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_ФорматыИнтеграций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйФормат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BATSH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DLL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/пбп_ТипыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>пбп_ТипыИнтеграций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыНастроекИнтеграций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_ИсторияИнтеграции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОписаниеПеременных

&НаКлиенте
Перем ДокументВнешнийОбъектИсходящий, ДокументВнешнийОбъектВходящий;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьСвойстваЭлементов();
	
	ЭтоЗагрузка = Объект.Статус = Перечисления.пбп_СтатусыИнтеграции.Загружено
		Или Объект.Статус = Перечисления.пбп_СтатусыИнтеграции.ОшибкаЗагрузки;
	Элементы.ГруппаОбъектыОбмена.Заголовок = ?(ЭтоЗагрузка, "Загруженные объекты", "Выгруженные объекты");
	
	Если Не Объект.Ошибка Тогда
		Элементы.ГруппаТекстОшибки.Видимость = Ложь;
		Элементы.Ошибка.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.XML
		Или Объект.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.JSON Тогда
		Элементы.ГруппаФорматированиеТекстаЗапроса.Видимость = Истина;
		Элементы.ВидОтображенияЗапроса.Видимость = Объект.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.JSON;
		Элементы.ИсходящееСообщение.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		Элементы.ВходящееСообщение.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		Элементы.ИсходящееСообщение.УстановитьДействие("ДокументСформирован",
			"ЗапросИсходящийДокументСформирован_Подключаемый");
		Элементы.ВходящееСообщение.УстановитьДействие("ДокументСформирован",
			"ЗапросВходящийДокументСформирован_Подключаемый");
	Иначе
		Элементы.ГруппаФорматированиеТекстаЗапроса.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ВходящееСообщение) Тогда
			ЗапросВходящийОтформатированный = ОтформатироватьСообщениеИнтеграции(Объект.ВходящееСообщение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИсходящееСообщение) Тогда
			ЗапросИсходящийОтформатированный = ОтформатироватьСообщениеИнтеграции(Объект.ИсходящееСообщение);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСтраницуОбъектовОбмена();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Предопределенный = "Перечисление.пбп_ФорматыИнтеграций.ПроизвольныйФормат";
	Если ЗначениеЗаполнено(Объект.ФорматИнтеграции) 
		И Объект.ФорматИнтеграции <> пбп_ПереадресацияКлиент.ПредопределенныйЭлемент(Предопределенный) Тогда
		ИнициализироватьБазовыйФайлРедактора(ПолучитьФорматИнтеграции(Объект.ФорматИнтеграции));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтображенияЗапросаПриИзменении(Элемент)
	
	Если ВидОтображенияЗапроса Тогда
		ИнициализироватьИЗаполнитьТекстомОбъектJSON("tree");
	Иначе
		ИнициализироватьИЗаполнитьТекстомОбъектJSON("code");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросИсходящийДокументСформирован_Подключаемый(Элемент)
	
	Предопределенный = "Перечисление.пбп_ФорматыИнтеграций.JSON";
	Если Объект.ФорматИнтеграции = пбп_ПереадресацияКлиент.ПредопределенныйЭлемент(Предопределенный) Тогда
		ИнициализироватьИЗаполнитьТекстомОбъектJSON("code", "Исходящий");
	Иначе
		ИнициализироватьИЗаполнитьТекстомОбъектXML("Исходящий");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросВходящийДокументСформирован_Подключаемый(Элемент)
	
	Предопределенный = "Перечисление.пбп_ФорматыИнтеграций.JSON";
	Если Объект.ФорматИнтеграции = пбп_ПереадресацияКлиент.ПредопределенныйЭлемент(Предопределенный) Тогда
		ИнициализироватьИЗаполнитьТекстомОбъектJSON("code", "Входящий");
	Иначе
		ИнициализироватьИЗаполнитьТекстомОбъектXML("Входящий");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОбъектыОбменаНомерВерсии" Тогда
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		Если ТекущаяСтрока <> Неопределено Тогда
			ПараметрыОтчета = Новый Структура;
			ПараметрыОтчета.Вставить("Ссылка", ТекущаяСтрока.ОбъектИнтеграции);
			
			СравниваемыеВерсии = Новый СписокЗначений;
			Если ТекущаяСтрока.НомерВерсии <> 1 Тогда
				Версия = ТекущаяСтрока.НомерВерсии - 1;
				СравниваемыеВерсии.Добавить(Версия, Версия);
			КонецЕсли;
			СравниваемыеВерсии.Добавить(ТекущаяСтрока.НомерВерсии, ТекущаяСтрока.НомерВерсии);
			ПараметрыОтчета.Вставить("СравниваемыеВерсии", СравниваемыеВерсии);
			
			ИмяФормыВерсионирования = "РегистрСведений.ВерсииОбъектов.Форма.ОтчетПоВерсиямОбъекта";
			
			ОткрытьФорму(ИмяФормыВерсионирования,
				ПараметрыОтчета,
				ЭтотОбъект,
				УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Предопределенный = "Перечисление.пбп_ФорматыИнтеграций.XML";
	Если Объект.ФорматИнтеграции = пбп_ПереадресацияКлиент.ПредопределенныйЭлемент(Предопределенный) Тогда
		Элементы.ИсходящееСообщение.Документ.defaultView.Xonomy.plusminus("xonomy1", True);
		Элементы.ВходящееСообщение.Документ.defaultView.Xonomy.plusminus("xonomy1", True);
	Иначе
		Если ВидОтображенияЗапроса Тогда
			ДокументВнешнийОбъектИсходящий.expandAll();
			ДокументВнешнийОбъектВходящий.expandAll();
		Иначе
			ДокументВнешнийОбъектИсходящий.format();
			ДокументВнешнийОбъектВходящий.format();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Предопределенный = "Перечисление.пбп_ФорматыИнтеграций.XML";
	Если Объект.ФорматИнтеграции = пбп_ПереадресацияКлиент.ПредопределенныйЭлемент(Предопределенный) Тогда
		Элементы.ИсходящееСообщение.Документ.defaultView.Xonomy.plusminus("xonomy1", False);
		Элементы.ВходящееСообщение.Документ.defaultView.Xonomy.plusminus("xonomy1", False);
	Иначе
		Если ВидОтображенияЗапроса Тогда
			ДокументВнешнийОбъектИсходящий.collapseAll();
			ДокументВнешнийОбъектВходящий.collapseAll();
		Иначе
			ДокументВнешнийОбъектИсходящий.compact();
			ДокументВнешнийОбъектВходящий.compact();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Команда)
	
	#Если Не МобильноеПриложениеКлиент И Не МобильныйКлиент Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация();
		Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Или ТипПлатформы.Linux_x86_64 Тогда
			ОбъектКопирования = Новый COMОбъект("htmlfile");
			Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗапросВходящий" Тогда
				ПолеКопирования = Объект.ВходящееСообщение;
			ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗапросИсходящий" Тогда
				ПолеКопирования = Объект.ИсходящееСообщение;
			Иначе
				Возврат;
			КонецЕсли;
			ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", ПолеКопирования);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлСообщенияОбмена(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайлаСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокДиалога = НСтр("ru = 'Укажите каталог сохранения файла'");
	
	СтруктураИмениФайла = пбп_ПереадресацияКлиентСервер.РазложитьПолноеИмяФайла(Объект.ИмяФайлаСообщения, Ложь);
	
	РежимОткрытияДиалога = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохранения = Новый ДиалогВыбораФайла(РежимОткрытияДиалога);
	ДиалогСохранения.ПолноеИмяФайла				= СтруктураИмениФайла.Имя;
	ДиалогСохранения.Расширение					= СтруктураИмениФайла.Расширение;
	ДиалогСохранения.Заголовок					= ЗаголовокДиалога;
	ФильтрВсеФайлы = пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Все файлы (%1)|%1'"), ПолучитьМаскуВсеФайлы());
	ДиалогСохранения.Фильтр						= ФильтрВсеФайлы;
	ДиалогСохранения.ПредварительныйПросмотр	= Ложь;
	ДиалогСохранения.Каталог					= "";
	
	Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораКаталогаСохранениеЗавершениеПослеВыбораВДиалоге", ЭтотОбъект);
	
	ДиалогСохранения.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваЭлементов()
	
	Элементы.СохранитьФайлСообщенияОбменаИсх.Заголовок = Объект.ИмяФайлаСообщения;
	Элементы.СохранитьФайлСообщенияОбменаВх.Заголовок = Объект.ИмяФайлаСообщения;
	
	Элементы.СвязьИстории.Видимость = ЗначениеЗаполнено(Объект.СвязьИстории);
	
	Если ЗначениеЗаполнено(Объект.ИнтеграционныйПоток) Тогда
		ТипИнтеграции = пбп_Переадресация.ЗначениеРеквизитаОбъекта(
			Объект.ИнтеграционныйПоток, "НастройкаИнтеграции.ТипИнтеграции");
		ЭлементНаследования = Справочники.пбп_ТипыИнтеграций
			.ПолучитьПредопределенныйЭлементНаследованияНастроекТипаИнтеграции(ТипИнтеграции);
		
		ЭтоВыгрузка = НаправлениеИнтеграцииВыгружено(Объект.Статус);
		
		Если ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.Каталог
			Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.FTPРесурсы Тогда
			УстановитьСвойстваЭлементовФайловогоОбмена(ТипИнтеграции, ЭтоВыгрузка);
		ИначеЕсли ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.ПочтовыйКлиент Тогда
			Элементы.ГруппаЗапросИсходящий.Заголовок = НСтр("ru = 'Содержимое тела письма';");
			Элементы.ГруппаЗапросИсходящий.Видимость = Истина;
			Элементы.ГруппаЗапросВходящий.Видимость = Ложь;
		ИначеЕсли ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.COM
			Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.ВнешняяКомпонента Тогда
			Элементы.ГруппаЗапросИсходящий.Видимость = Ложь;
			Элементы.ГруппаЗапросВходящий.Видимость = Ложь;
		ИначеЕсли ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.КоманднаяСтрока Тогда
			Элементы.ГруппаЗапросИсходящий.Заголовок = НСтр("ru = 'Выполняемая команда';");
			Элементы.ГруппаЗапросВходящий.Заголовок = НСтр("ru = 'Результат выполнения команды';");
			Элементы.ГруппаЗапросИсходящий.Видимость = Истина;
			Элементы.ГруппаЗапросВходящий.Видимость = Истина;
		Иначе
			Элементы.ГруппаЗапросИсходящий.Заголовок = НСтр("ru = 'Запрос исходящий';");
			Элементы.ГруппаЗапросВходящий.Заголовок = НСтр("ru = 'Запрос входящий';");
			Элементы.ГруппаЗапросИсходящий.Видимость = Истина;
			Элементы.ГруппаЗапросВходящий.Видимость = Истина;
		КонецЕсли;
		
		ВывестиСсылкуНаФайлПриНеобходимости(ЭтоВыгрузка, ЭлементНаследования, ТипИнтеграции);
	КонецЕсли;
	
	Элементы.ОбъектыОбменаНомерВерсии.Видимость =
		пбп_ОбщегоНазначенияПовтИсп.ПолучитьИспользованиеВерсионированияОбъектовОбмена();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФайловогоОбмена(ТипИнтеграции, ЭтоВыгрузка)
	
	ЗаголовокЗаписываемыйФайл = НСтр("ru = 'Содержимое записываемого файла';");
	ЗаголовокЧитаемыйФайл = НСтр("ru = 'Содержимое читаемого файла';");
	
	Если ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.SFTP Тогда
		Элементы.ГруппаЗапросИсходящий.Заголовок = НСтр("ru = 'Исполняемая команда';");
		Если ЭтоВыгрузка Тогда
			Элементы.ГруппаЗапросВходящий.Заголовок = ЗаголовокЗаписываемыйФайл;
		Иначе
			Элементы.ГруппаЗапросВходящий.Заголовок = ЗаголовокЧитаемыйФайл;
		КонецЕсли;
	Иначе
		Элементы.ГруппаЗапросИсходящий.Заголовок = ЗаголовокЗаписываемыйФайл;
		Элементы.ГруппаЗапросВходящий.Заголовок = ЗаголовокЧитаемыйФайл;
		
		Элементы.ГруппаЗапросИсходящий.Видимость = ЭтоВыгрузка;
		Элементы.ГруппаЗапросВходящий.Видимость = Не ЭтоВыгрузка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаправлениеИнтеграцииВыгружено(СтатусОбмена)
	
	Возврат СтатусОбмена = Перечисления.пбп_СтатусыИнтеграции.Выгружено
		Или СтатусОбмена = Перечисления.пбп_СтатусыИнтеграции.ОшибкаВыгрузки
		Или СтатусОбмена = Перечисления.пбп_СтатусыИнтеграции.Служебный
		Или СтатусОбмена = Перечисления.пбп_СтатусыИнтеграции.ОшибкаСлужебного;
	
КонецФункции

&НаСервере
Процедура ВывестиСсылкуНаФайлПриНеобходимости(ЭтоВыгрузка, ЭлементНаследования, ТипИнтеграции)
	
	ПоказатьСсылкуНаФайлВместоЗапроса = Не ПустаяСтрока(Объект.ИмяФайлаСообщения)
		И Не (ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.COM
		Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.ВнешняяКомпонента);
	
	Если ПоказатьСсылкуНаФайлВместоЗапроса Тогда
		Если ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.Каталог
			Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.FTPРесурсы
			Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.ПочтовыйКлиент Тогда
			Если ТипИнтеграции = Справочники.пбп_ТипыИнтеграций.SFTP Тогда
				Элементы.ГруппаДанныеСообщенияИсходящего.Видимость = Ложь;
				Элементы.ИсходящееСообщение.Видимость = Истина;
				Элементы.ГруппаДанныеСообщенияВходящего.Видимость = Истина;
				Элементы.ВходящееСообщение.Видимость = Ложь;
			Иначе
				Элементы.ГруппаДанныеСообщенияИсходящего.Видимость = ЭтоВыгрузка;
				Элементы.ИсходящееСообщение.Видимость = Не ЭтоВыгрузка;
				Элементы.ГруппаДанныеСообщенияВходящего.Видимость = Не ЭтоВыгрузка;
				Элементы.ВходящееСообщение.Видимость = ЭтоВыгрузка;
			КонецЕсли;
		ИначеЕсли ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.RESTAPI
			Или ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.SOAP Тогда
			Элементы.ГруппаДанныеСообщенияИсходящего.Видимость = ЭтоВыгрузка;
			Элементы.ГруппаДанныеСообщенияВходящего.Видимость = Не ЭтоВыгрузка;
		Иначе
			Элементы.ГруппаДанныеСообщенияИсходящего.Видимость = ЭтоВыгрузка;
			Элементы.ГруппаДанныеСообщенияВходящего.Видимость = Не ЭтоВыгрузка;
			Элементы.ИсходящееСообщение.Видимость = Ложь;
			Элементы.ВходящееСообщение.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаДанныеСообщенияИсходящего.Видимость = Ложь;
		Элементы.ГруппаДанныеСообщенияВходящего.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтформатироватьСообщениеИнтеграции(Знач ТекстСообщенияИнтеграции)
	
	Если Объект.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.XML
		И СтрНайти(ТекстСообщенияИнтеграции, "xml") <> 0 Тогда
		Запрос = пбп_ИнтеграцииСервер.ОтформатироватьXMLЧерезDOM(ТекстСообщенияИнтеграции, Истина);
	Иначе
		Запрос = ТекстСообщенияИнтеграции;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьБазовыйФайлРедактора(ФорматИнтеграцииСтрокой)
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Редактор " + ФорматИнтеграцииСтрокой + " не предназначен для веб-клиента'");
	#Иначе
		Если ФорматИнтеграцииСтрокой = "JSON" Тогда
			СохранитьБазовыйФайлРедактора(ФорматИнтеграцииСтрокой);
		ИначеЕсли ФорматИнтеграцииСтрокой = "XML" Тогда
			СохранитьБазовыйФайлРедактора(ФорматИнтеграцииСтрокой, "Out");
			СохранитьБазовыйФайлРедактора(ФорматИнтеграцииСтрокой, "In");
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьБазовыйФайлРедактора(ФорматИнтеграции, Дополнение = "")
	
	Расширение = ФорматИнтеграции + "Editor" + Дополнение;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФорматИнтеграции"	, ФорматИнтеграции);
	ДополнительныеПараметры.Вставить("Дополнение"		, Дополнение);
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеСозданияВременногоКаталогаДляБазовогоРедактора",
		ЭтотОбъект, ДополнительныеПараметры);
	пбп_ПереадресацияКлиент.СоздатьВременныйКаталог(Оповещение, Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияВременногоКаталогаДляБазовогоРедактора(
	Результат, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		ДвоичныеДанные = ДвоичныеДанныеМакета(ДополнительныеПараметры.ФорматИнтеграции);
		
		Чтение = Новый ЧтениеДанных(ДвоичныеДанные);
		Файл = Новый ЧтениеZipФайла(Чтение.ИсходныйПоток());
		Файл.ИзвлечьВсе(Результат);
		
		БазовыйФайлРедактора = Результат + ПолучитьРазделительПути() + "index.html";
		
		Если ДополнительныеПараметры.ФорматИнтеграции = "JSON" Тогда
			ЗапросИсходящийОтформатированный = БазовыйФайлРедактора;
			ЗапросВходящийОтформатированный = БазовыйФайлРедактора;
		ИначеЕсли ДополнительныеПараметры.Дополнение = "Out" Тогда
			ЗапросИсходящийОтформатированный = БазовыйФайлРедактора;
		Иначе
			ЗапросВходящийОтформатированный = БазовыйФайлРедактора;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьИЗаполнитьТекстомОбъектJSON(ВидОтображения, ТипЗапроса = "")
	
	Если ТипЗапроса = "Исходящий" Тогда
		Если ДокументВнешнийОбъектИсходящий <> Неопределено Тогда
			ДокументВнешнийОбъектИсходящий.destroy();
		КонецЕсли;
		
		ДокументВнешнийОбъектИсходящий = Элементы.ИсходящееСообщение.Документ.defaultView.Init(ВидОтображения);
		ДокументВнешнийОбъектИсходящий.setName("Корень"); // Установка имени верхнего уровня для дерева
		ДокументВнешнийОбъектИсходящий.setText(Объект.ИсходящееСообщение);
	
	ИначеЕсли ТипЗапроса = "Входящий" Тогда
		Если ДокументВнешнийОбъектВходящий <> Неопределено Тогда
			ДокументВнешнийОбъектВходящий.destroy();
		КонецЕсли;
		
		ДокументВнешнийОбъектВходящий = Элементы.ВходящееСообщение.Документ.defaultView.Init(ВидОтображения);
		ДокументВнешнийОбъектВходящий.setName("Корень"); // Установка имени верхнего уровня для дерева
		ДокументВнешнийОбъектВходящий.setText(Объект.ВходящееСообщение);
	Иначе
		Если ДокументВнешнийОбъектИсходящий <> Неопределено Тогда
			ДокументВнешнийОбъектИсходящий.destroy();
		КонецЕсли;
		
		ДокументВнешнийОбъектИсходящий = Элементы.ИсходящееСообщение.Документ.defaultView.Init(ВидОтображения);
		ДокументВнешнийОбъектИсходящий.setName("Корень"); // Установка имени верхнего уровня для дерева
		ДокументВнешнийОбъектИсходящий.setText(Объект.ИсходящееСообщение);
		
		Если ДокументВнешнийОбъектВходящий <> Неопределено Тогда
			ДокументВнешнийОбъектВходящий.destroy();
		КонецЕсли;
		
		Если Элементы.ВходящееСообщение.Документ <> Неопределено Тогда
			ДокументВнешнийОбъектВходящий = Элементы.ВходящееСообщение.Документ.defaultView.Init(ВидОтображения);
			ДокументВнешнийОбъектВходящий.setName("Корень"); // Установка имени верхнего уровня для дерева
			ДокументВнешнийОбъектВходящий.setText(Объект.ВходящееСообщение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьИЗаполнитьТекстомОбъектXML(ТипЗапроса)
	
	Если ТипЗапроса = "Исходящий" Тогда
		Элементы.ИсходящееСообщение.Документ.defaultView.start(
			ОтформатироватьСообщениеИнтеграции(Объект.ИсходящееСообщение), "nerd");
	Иначе
		Элементы.ВходящееСообщение.Документ.defaultView.start(
			ОтформатироватьСообщениеИнтеграции(Объект.ВходящееСообщение), "nerd");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДвоичныеДанныеМакета(Знач ФорматИнтеграцииСтрокой)
	
	Возврат ПолучитьОбщийМакет("пбп_" + ФорматИнтеграцииСтрокой + "Editor");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФорматИнтеграции(ФорматИнтеграции)
	
	ИндексЗначенияПеречисления = Перечисления.пбп_ФорматыИнтеграций.Индекс(ФорматИнтеграции);
	ФорматИнтеграцииСтрокой = Метаданные.Перечисления.пбп_ФорматыИнтеграций
		.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
	Возврат ФорматИнтеграцииСтрокой;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораКаталогаСохранениеЗавершениеПослеВыбораВДиалоге(
	Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Результат[0];
	
	ДвоичныеДанныеФайла = ОбработчикВыбораКаталогаСохранениеЗавершениеПослеВыбораВДиалогаНаСервере();
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Функция ОбработчикВыбораКаталогаСохранениеЗавершениеПослеВыбораВДиалогаНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.ПолучитьДанныеФайлаСообщения();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтраницуОбъектовОбмена()
	
	ДанныеРегистров = Новый ТаблицаЗначений;
	ДанныеРегистров.Колонки.Добавить("ИмяРегистра");
	ДанныеРегистров.Колонки.Добавить("Отбор");
	
	ЗаполнитьФормуОбъектамиСсылочныхТипов(ДанныеРегистров);
	
	Если Не ДанныеРегистров.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаИмяРегистра = ДанныеРегистров.Скопировать();
	КолонкаИмяРегистра.Свернуть("ИмяРегистра");
	
	МассивИменРегистров = КолонкаИмяРегистра.ВыгрузитьКолонку("ИмяРегистра");
	
	ДополнитьФормуТаблицамиРегистров(МассивИменРегистров);
	ЗаполнитьФормуЗаписямиРегистров(МассивИменРегистров, ДанныеРегистров);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуОбъектамиСсылочныхТипов(ДанныеРегистров)
	
	РеквизитЗначение = РеквизитФормыВЗначение("Объект");
	Для Каждого Строка Из РеквизитЗначение.ОбъектыИнтеграции Цикл
		Если Строка.ЭтоЗаписьРегистра Тогда
			ЗначениеИзХранилища = Строка.ОтборыРегистра.Получить();
			Если ЗначениеИзХранилища <> Неопределено Тогда
				НовыйОтбор = ДанныеРегистров.Добавить();
				НовыйОтбор.ИмяРегистра	= ЗначениеИзХранилища.ИмяРегистра;
				НовыйОтбор.Отбор		= ЗначениеИзХранилища.Отбор;
			КонецЕсли;
		Иначе
			НоваяСтрока = ОбъектыОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ЗагруженныйОбъектТипЗначения = ТипЗнч(Строка.ОбъектИнтеграции);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьФормуТаблицамиРегистров(МассивИменРегистров)
	
	СтруктураРеквизитов = Новый Структура;
	Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
		
		Если Метаданные.НайтиПоПолномуИмени(ИмяРегистра) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИмяРегистраФорма = СтрЗаменить(ИмяРегистра, ".", "_");
		СтруктураРеквизитов.Вставить(ИмяРегистраФорма, пбп_РаботаСФормами.ОписаниеТипаТаблицаЗначений());
		
	КонецЦикла;
	
	Если Не СтруктураРеквизитов.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	пбп_РаботаСФормами.СоздатьРеквизиты(ЭтотОбъект, СтруктураРеквизитов);
	
	ГруппаСтраницыПоТипам = Элементы.ГруппаОбъектыПоТипам;
	Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
		
		ИмяРегистраФорма = СтрЗаменить(ИмяРегистра, ".", "_");
		МетаданныеРегистра = Метаданные.НайтиПоПолномуИмени(ИмяРегистра);
		Если МетаданныеРегистра = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураКолонок = Новый Структура;
		
		МассивНаименованийГруппПолей = Новый Массив;
		МассивНаименованийГруппПолей.Добавить("СтандартныеРеквизиты");
		МассивНаименованийГруппПолей.Добавить("Измерения");
		МассивНаименованийГруппПолей.Добавить("Ресурсы");
		МассивНаименованийГруппПолей.Добавить("Реквизиты");
		Для Каждого ГруппаПолей Из МассивНаименованийГруппПолей Цикл
			Для Каждого ПолеРегистра Из МетаданныеРегистра[ГруппаПолей] Цикл
				СтруктураРеквизитов.Вставить(ПолеРегистра.Имя, ПолеРегистра.Тип);
				СтруктураКолонок.Вставить(ПолеРегистра.Имя, "");
			КонецЦикла;
		КонецЦикла;
		
		пбп_РаботаСФормами.СоздатьРеквизитыТаблицы(ЭтотОбъект, ИмяРегистраФорма, СтруктураРеквизитов);
		
		ГруппаСтраницаРегистра = пбп_РаботаСФормами.СоздатьСтраница(ЭтотОбъект,
			"Страница_" + ИмяРегистраФорма, ГруппаСтраницыПоТипам, МетаданныеРегистра.Синоним);
		
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("ТолькоПросмотр", Истина);
		СтруктураСвойств.Вставить("ИзменятьСоставСтрок", Ложь);
		СтруктураСвойств.Вставить("ИзменятьПорядокСтрок", Ложь);
		
		пбп_РаботаСФормами.СоздатьТаблицаФормы(ЭтотОбъект,
			"Таблица_" + ИмяРегистраФорма, ГруппаСтраницаРегистра,
			ИмяРегистраФорма, СтруктураКолонок, СтруктураСвойств);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуЗаписямиРегистров(МассивИменРегистров, ДанныеРегистров)
	
	ТекстЗапросаШаблон = "ВЫБРАТЬ
	|	ТаблицаЗначений.*
	|ПОМЕСТИТЬ %1
	|ИЗ
	|	&%1 КАК ТаблицаЗначений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	СтруктураРегистров = Новый Структура;
	МассивТекстовЗапросов = Новый Массив;
	Запрос = Новый Запрос;
	
	НомерПакетаВыборки = 1;
	Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
		
		ИмяРегистраФорма = СтрЗаменить(ИмяРегистра, ".", "_");
		МетаданныеРегистра = Метаданные.НайтиПоПолномуИмени(ИмяРегистра);
		Если МетаданныеРегистра = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТаблицаОтборовРегистра = ПолучитьТаблицуОтборовПоРегистру(
			ДанныеРегистров, МетаданныеРегистра, ИмяРегистра);
		Если Не ТаблицаОтборовРегистра.Количество()
			Или Не ТаблицаОтборовРегистра.Колонки.Количество() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ИмяРегистраФорма, ТаблицаОтборовРегистра);
		
		МассивВыборки = Новый Массив;
		МассивНомеровЗапроса = Новый Массив;
		ДополнитьТекстЗапросаРегистровОтборами(ТаблицаОтборовРегистра,
			ИмяРегистраФорма, ИмяРегистра, МассивВыборки, МассивНомеровЗапроса, НомерПакетаВыборки);
		Если Не МассивВыборки.Количество() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТекстЗапроса = СтрШаблон(ТекстЗапросаШаблон, ИмяРегистраФорма)
			+ СтрСоединить(МассивВыборки, пбп_Переадресация.РазделительПакетаЗапросов());
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		СтруктураРегистров.Вставить(ИмяРегистраФорма, МассивНомеровЗапроса);
		НомерПакетаВыборки = НомерПакетаВыборки + 2;
		
	КонецЦикла;
	
	Если Не МассивТекстовЗапросов.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(МассивТекстовЗапросов, пбп_Переадресация.РазделительПакетаЗапросов());
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Для Каждого КлючИЗначение Из СтруктураРегистров Цикл
		Для Каждого НомерПакета Из КлючИЗначение.Значение Цикл
			ВыборкаРезультатаЗапроса = РезультатПакета[НомерПакета].Выбрать();
			Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ЭтотОбъект[КлючИЗначение.Ключ].Добавить(), ВыборкаРезультатаЗапроса);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуОтборовПоРегистру(ДанныеРегистров, МетаданныеРегистра, ИмяРегистра)
	
	ТаблицаОтборовРегистра = Новый ТаблицаЗначений;
	МассивКолонок = Новый Массив;
	
	СтрокиРегистров = ДанныеРегистров.НайтиСтроки(Новый Структура("ИмяРегистра", ИмяРегистра));
	
	Для Каждого СтандартныйРеквизит Из МетаданныеРегистра.СтандартныеРеквизиты Цикл;
		Если СтандартныйРеквизит.Имя = "Период" Или СтандартныйРеквизит.Имя = "Регистратор" Тогда
			ТаблицаОтборовРегистра.Колонки.Добавить(СтандартныйРеквизит.Имя, СтандартныйРеквизит.Тип);
			МассивКолонок.Добавить(СтандартныйРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл;
		ТаблицаОтборовРегистра.Колонки.Добавить(Измерение.Имя, Измерение.Тип);
		МассивКолонок.Добавить(Измерение.Имя);
	КонецЦикла;
	
	СтрокаИменКолонок = СтрСоединить(МассивКолонок, ",");
	
	Для Каждого НайденнаяСтрока Из СтрокиРегистров Цикл
		НоваяСтрокаОтбора = ТаблицаОтборовРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОтбора, НайденнаяСтрока.Отбор);
	КонецЦикла;
	
	// Выборка будет выполняться только по уникальным отборам в измерениях
	ТаблицаОтборовРегистра.Свернуть(СтрокаИменКолонок);
	
	Возврат ТаблицаОтборовРегистра;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьТекстЗапросаРегистровОтборами(ТаблицаОтборовРегистра,
	ИмяРегистраФорма, ИмяРегистра, МассивВыборки, МассивНомеровЗапроса, НомерПакетаВыборки)
	
	ТекстВыборкиШаблон = "
	|ВЫБРАТЬ
	|	ДанныеРегистра.*
	|ИЗ
	|	%1 КАК ВТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ %2 КАК ДанныеРегистра
	|		ПО %3";
	
	МассивУсловий = Новый Массив;
	Для Каждого Колонка Из ТаблицаОтборовРегистра.Колонки Цикл
		
		ТипыКолонки = Колонка.ТипЗначения.Типы();
		ТекстШаблонаУсловия = ПолучитьСтрокуСоединенияСРегистром(ТипыКолонки);
		МассивУсловий.Добавить(СтрШаблон(ТекстШаблонаУсловия, Колонка.Имя));
		
	КонецЦикла;
	
	Если Не МассивУсловий.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаУсловий = СтрСоединить(МассивУсловий, "
	|		И ");
	ТекстВыборки = СтрШаблон(ТекстВыборкиШаблон, ИмяРегистраФорма, ИмяРегистра, СтрокаУсловий);
	МассивВыборки.Добавить(ТекстВыборки);
	МассивНомеровЗапроса.Добавить(НомерПакетаВыборки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокуСоединенияСРегистром(ТипыКолонки)
	
	Если ТипыКолонки.Количество() = 1 Тогда
		
		Если ТипыКолонки[0] = Тип("Число") Тогда
			
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = 0)";
			
		ИначеЕсли ТипыКолонки[0] = Тип("Булево") Тогда
			
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = ЛОЖЬ)";
			
		ИначеЕсли ТипыКолонки[0] = Тип("Строка") Тогда
			
			Кавычка = """";
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = " + Кавычка + Кавычка + ")";
			
		ИначеЕсли ТипыКолонки[0] = Тип("Дата") Тогда
			
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
			
		ИначеЕсли пбп_Переадресация.ЭтоСсылка(ТипыКолонки[0]) Тогда
			
			ПолноеИмяДанных = Метаданные.НайтиПоТипу(ТипыКолонки[0]).ПолноеИмя();
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = ЗНАЧЕНИЕ("
				+ ПолноеИмяДанных + ".ПустаяСсылка))";
			
		Иначе
			
			Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = НЕОПРЕДЕЛЕНО)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "(ВТ.%1 = ДанныеРегистра.%1 ИЛИ ВТ.%1 = НЕОПРЕДЕЛЕНО)";
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
